#+Title: CSTNews Statistics

#+name: iaa
#+BEGIN_SRC lisp :package "cstnews"
(mapcar #'car (file->list "data/cstnews-verb-suggestions.txt"))
#+END_SRC

#+BEGIN_SRC lisp :var dados=iaa :results output
(rcl:r% "print" (rcl:r% "table" dados))
#+END_SRC

#+BEGIN_SRC lisp :var dados=iaa :results value
  (let ((tb (make-hash-table))
        (total (length dados)))
    (mapcar (lambda (n) (incf (gethash n tb 0))) dados)
    (loop for v being the hash-values in tb using (hash-key k)
          collect (list k v (format nil "~5$" (/ v total)))))
#+END_SRC

#+RESULTS:
| -1 | 2032 | 0.38675 |
|  0 | 1649 | 0.31386 |
|  1 |  548 | 0.10430 |
|  2 |  366 | 0.06966 |
|  3 |  201 | 0.03826 |
|  4 |  120 | 0.02284 |
|  5 |  111 | 0.02113 |
|  6 |   88 | 0.01675 |
|  7 |   40 | 0.00761 |
|  8 |   31 | 0.00590 |
|  9 |   17 | 0.00324 |
| 10 |    9 | 0.00171 |
| 11 |   13 | 0.00247 |
| 12 |    2 | 0.00038 |
| 13 |    7 | 0.00133 |
| 14 |    5 | 0.00095 |
| 15 |    5 | 0.00095 |
| 16 |    1 | 0.00019 |
| 17 |    1 | 0.00019 |
| 18 |    1 | 0.00019 |
| 19 |    5 | 0.00095 |
| 20 |    2 | 0.00038 |


